#### TemporaryGraphicsCommandData Members

---

|  |
| --- |
| TemporaryGraphicsCommandData Class   Methods   Properties   See Also |

The  TemporaryGraphicsCommandData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  TemporaryGraphicsCommandData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Document | The document. |
| Public property | Index | The unique index of the temporary graphics object managed by  TemporaryGraphicsManager  . |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

TemporaryGraphicsCommandData Class

Autodesk.Revit.UI Namespace